'use strict'

/*===========================================*/
//---Функции

import './components/functions.js'

/*===========================================*/
//---Подключение модулей

import * as modules from './components/modules.js'

/*===========================================*/
//--- Учет плавающей панели на мобильных устройствах

// modules.fullVHfix()

/*===========================================*/
//---Плавный скролл к ссылке

// import smoothscroll from 'smoothscroll-polyfill';
// modules.smoothScroll();

/*===========================================*/
//---Фиксация header

// modules.addFixedHeader();

/*===========================================*/
//---Меню

// modules.menuInit();

/*===========================================*/
//---Модальные окна

// modules.modalsInit();

/*===========================================*/
//---Споллеры

// Для родителя слойлеров пишем атрибут data-spollers
// Для заголовков слойлеров пишем атрибут data-spoller
// Если нужно включать\выключать работу спойлеров на разных размерах экранов
// пишем параметры ширины и типа брейкпоинта.
// Например:
// data-spollers="992,max" - спойлеры будут работать только на экранах меньше или равно 992px
// data-spollers="768,min" - спойлеры будут работать только на экранах больше или равно 768px

// Если нужно что бы в блоке открывался болько один слойлер добавляем атрибут data-one-spoller

// modules.spollersInit();

// Подключить модули анимации (в самом конце)

/*===========================================*/
//---Табы

modules.tabsInit();

/*===========================================*/
//---Динамический адаптив

// data-da="where(uniq class name),position(digi),when(breakpoint)"

// modules.daInit();

/*===========================================*/
//---Show more

// modules.showMore();

// Подключить модули анимации (в самом конце)

/*===========================================*/
//---Select

// const select = new modules.Select('.select', {
// 	placeholder: 'Выбери пожалуйста элемент',
// 	selectedId: '2',
// 	data: [
// 	  {id: '1', value: 'React'},
// 	  {id: '2', value: 'Angular'},
// 	  {id: '3', value: 'Vue'},
// 	  {id: '4', value: 'React Native'},
// 	  {id: '5', value: 'Next'},
// 	  {id: '6', value: 'Nest'}
// 	],
// 	onSelect(item) {
// 	  console.log('Selected Item', item)
// 	}
// })

// window.s = select;

/*===========================================*/
//---Quantity

// modules.quantityInit();

/*===========================================*/
//---Range line

// modules.progressInit() // <- получить элемент

/*===========================================*/
//---Star rating

// modules.starRatingInit();

/*===========================================*/
//---Вспомогательные функции анимаций (для spollers, showmore)

// modules._slideDown();
// modules._slideToggle();
// modules._slideUp();

/*===========================================*/
//---Основной скрипт

import './components/script.js'